# 'brew tap'
tap "homebrew/cask"
tap homebrew/cask-versions
tap homebrew/cask-drivers
tap homebrew/cask-fonts

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Formulae
brew "imagemagick"
brew "autoconf"
brew "autojump"
brew "bash-completion"
brew "chruby"
brew "dos2unix"
brew "findutils"
brew "git"
brew "git-extras"
brew "grip"
brew "gti"
brew "htop-osx"
brew "keepingyouawake"
brew "markdown"
brew "mas"
brew "mysql"
brew "nodenv"
brew "node-build"
brew "pkg-config"
brew "python"
brew "readline"
brew "ripgrep"
brew "ruby-build"
brew "ruby-install"
brew "ssh-copy-id"
brew "tig"
brew "trash"
brew "tree"
brew "unrar"
brew "vim"
brew "wget"
brew "zsh"

# Casks
cask "google-chrome", greedy: true
cask "1password", greedy: true
cask "alfred", greedy: true
cask "docker", greedy: true
cask "dockstation", greedy: true
cask "dropbox", greedy: true
cask "fantastical", greedy: true
cask "iterm2-beta", greedy: true
cask "logitech"-options, greedy: true
cask "lastfm", greedy: true
cask "qlcolorcode", greedy: true
cask "qlimagesize", greedy: true
cask "qlmarkdown", greedy: true
cask "quicklook-json", greedy: true
cask "rescuetime", greedy: true
cask "sequel-pro", greedy: true
cask "station", greedy: true
cask "spectacle", greedy: true
cask "spotify", greedy: true
cask "webpquicklook", greedy: true
cask "visual"-studio-code, greedy: true
cask "viscosity", greedy: true

# Fonts
cask "font-fira-code"

# Mac AppStore
mas "Giphy Capture", id: 668208984
