# CLI Tools
brew "git"
brew "git-delta"          # Better diffs: `git diff` shows side-by-side with syntax highlighting
brew "gh"                 # GitHub CLI: `gh pr create`, `gh issue list`, `gh auth login`
brew "ripgrep"            # Fast search: `rg "pattern"` (replaces ag/grep)
brew "fd"                 # Modern find: `fd "*.json"` (replaces `find . -name "*.json"`)
brew "bat"                # Modern cat: `bat file.txt` (syntax highlighting, line numbers)
brew "eza"                # Modern ls: `eza -la --icons --git` (replaces ls)
brew "zoxide"             # Smart cd: `z project` jumps to ~/dev/project (replaces autojump)
brew "fzf"                # Fuzzy finder: `ctrl-r` for history, `ctrl-t` for files
brew "jq"                 # JSON processor: `curl api | jq '.data'`
brew "htop"               # Process viewer (renamed from htop-osx)
brew "tree"
brew "trash"
brew "wget"
brew "vim"
brew "mise"               # Runtime manager: `mise use node@22` (replaces nodenv, chruby, pyenv)
brew "dos2unix"
brew "tig"
brew "git-extras"
brew "zsh-syntax-highlighting"  # Fish-like syntax highlighting for zsh

# Apps
cask "1password"
cask "alfred"
cask "arc"
cask "claude-code"
cask "conductor"
cask "docker-desktop"
cask "google-chrome"
cask "iterm2"
cask "keepingyouawake"
cask "rectangle"          # Window tiling (replaces spectacle). macOS Tahoe has built-in tiling too
cask "rescuetime"
cask "lastfm"
cask "linear-linear"
cask "visual-studio-code"

# Fonts
cask "font-fira-code-nerd-font"  # Fira Code + icons for terminal/vim status lines
