anthropic.claude-code
ast-grep.ast-grep-vscode
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
deque-systems.vscode-axe-linter
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
foxundermoon.shell-format
github.codespaces
github.copilot
github.copilot-chat
github.vscode-github-actions
jebbs.super-replace
mikestead.dotenv
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
nopjmp.fairyfloss
pkief.material-icon-theme
redhat.vscode-yaml
vscodevim.vim
wayou.vscode-todo-highlight
xabikos.javascriptsnippets
xabikos.reactsnippets
